Revit 2025 API
Curve.Intersect Method
Calculates the intersection of this curve with the specified curve.
Overload List
Name | Description
Intersect(Curve) | Calculates the intersection of this curve with the specified curve.
Intersect(Curve, IntersectionResultArray) | Calculates the intersection of this curve with the specified curve and returns the intersection results.
Top
See Also
Reference
Curve Class
Autodesk.Revit.DB Namespace